In [ ]:
import pandas as pd 
import numpy as np

In [17]:
data = pd.DataFrame({
    'Name':['Tanzim','Arunima','Nusrat',np.nan,'Ethan'],
    'Age':[21,np.nan,20,.35,23],
    'Salary': [50000,40000,4300,26000,30000]
}) 
print(data)

      Name    Age  Salary
0   Tanzim  21.00   50000
1  Arunima    NaN   40000
2   Nusrat  20.00    4300
3      NaN   0.35   26000
4    Ethan  23.00   30000

In [21]:


data = pd.DataFrame({
    'Name': ['Tanzim','Arunima','Nusrat',np.nan,'Ethan'],
    'Age': [21, np.nan, 20, 35, 23],
    'Salary': [50000, 40000, 4300, np.nan, 30000]
})

print(data)

      Name   Age   Salary
0   Tanzim  21.0  50000.0
1  Arunima   NaN  40000.0
2   Nusrat  20.0   4300.0
3      NaN  35.0      NaN
4    Ethan  23.0  30000.0

In [19]:
data_dropna= data.dropna() # delete null value

In [20]:
data_dropna

     Name   Age  Salary
0  Tanzim  21.0   50000
2  Nusrat  20.0    4300
4   Ethan  23.0   30000

In [ ]:
# Fill missing values (NaN) in the DataFrame using specific rules
data_filled = data.fillna({

                         # 1. For the 'Name' column:
                         # If any cell is NaN → replace it with the string 'Unknown'
    'Name': 'Unknown',

                         # 2. For the 'Age' column:
                         # If any cell is NaN → replace it with the mean (average) of the 'Age' column
    'Age': data['Age'].mean(),

                         # 3. For the 'Salary' column:
                         # If any cell is NaN → replace it with 0
    'Salary': 0
})

In [26]:
data_filled

      Name    Age   Salary
0   Tanzim  21.00  50000.0
1  Arunima  24.75  40000.0
2   Nusrat  20.00   4300.0
3  Unknown  35.00      0.0
4    Ethan  23.00  30000.0

In [ ]:
# data= data.dropna()   #totaly replese main data 
# data

     Name   Age  Salary
0  Tanzim  21.0   50000
2  Nusrat  20.0    4300
4   Ethan  23.0   30000